{
    "polite": [
        "In a different season of life, I might say yes—but not right now.",
        "While I appreciate it, pursuing this isn't something I can commit to.",
        "It sounds interesting, but I’m not the best person for this.",
        "I appreciate the thought, but it’s not the right fit for me right now.",
        "I'm trying to be more intentional with what I agree to, and this doesn’t quite fit.",
        "I want to be honest with you—I don’t feel comfortable committing to this.",
        "I have to trust my gut—and it's gently suggesting a no.",
        "Saying no to this helps me say yes to something that matters more to me.",
        "I’m going to respectfully decline. It doesn’t align with where I’m heading.",
        "This opportunity deserves more than I can give it right now.",
        "I’ve made peace with declining things that don’t energize me.",
        "You’ve put great energy into this, and I hope you understand my decision to step back.",
        "This doesn’t align with my values or current focus.",
        "I respect the opportunity, but I know my limits—and this would stretch them too far.",
        "I truly value our connection, and I hope my no doesn’t change that.",
        "It’s not a no forever, but it’s a no for now.",
        "That’s not something I can prioritize at the moment."
    ],
    "funny": [
        "Every time I think about it, I hear a tiny ‘nope’ in the wind.",
        "My future self wrote me a note: ‘Please don’t do this again.’",
        "I'd love to say yes, but I just made a commitment to do less questionable things this week.",
        "Even my calendar laughed when I tried to squeeze this in.",
        "This feels like something Future Me would yell at Present Me for agreeing to.",
        "Even my coffee said, ‘Not today.’",
        "My inner peace committee vetoed this idea unanimously.",
        "I had a vision of doing this—and then promptly fell asleep in it.",
        "If I said yes, the universe might collapse from the shock.",
        "Me agreeing? That's like dividing by zero—dangerous and not allowed.",
        "My goldfish is getting married that day, I have to attend.",
        "My guardian unicorn says I shouldn't.",
        "My pet dragon has a vet appointment, can't miss it.",
        "The fortune cookie said 'No' just last night.",
        "My tarot cards all just collectively sighed.",
        "I checked my crystal ball, and it said 'nah'.",
        "I wrote you a poem: Roses are red, violets are blue, my answer is no, no can do."
    ],
    "introvert": [
        "I’m not not feeling up to it tonight, rain check?",
        "My social battery died and the charger is on backorder.",
        "I’ve exceeded my people-ing quota for the week.",
        "I'm introverting so hard right now, I can't stop to do that.",
        "I'm away on an introvert adventure (indoors, alone).",
        "I can't come out; I've recently taken up hermit life.",
        "Socializing is off the table, literally, I flipped the table.",
        "I'm allergic to crowds, and even one person counts sometimes.",
        "I'm practicing social distancing... from everyone.",
        "Public me is out of office; please contact me never.",
        "I have to cancel; I've exceeded my people-ing quota for the week."
    ],
    "lazy": [
        "I have a meeting with my couch and it won’t take no for an answer.",
        "I'm busy rearranging my sock drawer by color and mood.",
        "I need to finish an intense session of doing nothing at all.",
        "I've a prior commitment to binge-watching paint dry.",
        "I'm in the middle of a very important procrastination marathon.",
        "I can't; I'm attending the opening of my refrigerator.",
        "I've made a vow to avoid any form of productivity.",
        "I have an appointment with a pillow and a blanket.",
        "I'm saving my energy for an epic nap.",
        "I can't be bothered to change out of my comfortable blanket burrito.",
        "Moving from this spot requires 24-hour notice."
    ],
    "savage": [
        "I'd rather bathe in week-old soup than do that.",
        "I prefer to juggle chainsaws blindfolded—seems safer than saying yes.",
        "I would climb Mount Everest barefoot before I'd agree to that.",
        "I'd rather be the sole target in a paintball match than participate.",
        "Honestly, chewing glass sounds more fun than saying yes to this.",
        "I'd rather do my own dental surgery with no anesthesia.",
        "Saying yes? I'd sooner challenge a kangaroo to a boxing match.",
        "I'd rather walk on Lego bricks for an hour straight.",
        "I prefer the thrill of not doing it, thanks.",
        "Unless there's a cash prize for me, I'll have to decline.",
        "Not even if there were free donuts.",
        "Go away."
    ],
    "developer": [
        "I'm stuck in a merge conflict that's taking longer than expected.",
        "My internet is acting up and I can't pull the latest changes.",
        "I need to restart my machine, updates are forcing a reboot.",
        "I'm debugging a critical issue in the production environment.",
        "The build failed and I'm trying to figure out why.",
        "I'm blocked waiting for access permissions.",
        "The server is down and I'm on call.",
        "My local environment is corrupted.",
        "The API is throwing 500 errors.",
        "I'm waiting for the database migration to finish.",
        "Docker is eating all my RAM.",
        "Any timeline where I say yes ends in chaos, so I'm choosing wisely.",
        "Accepting that offer would cause a glitch in the Matrix.",
        "I'm waiting for IT to resolve a ticket."
    ]
}